[Release] v2.5.0 (#147)
* [Feature] Timestep (#142)

* uml and some basic constructors

Updating public diagram

updating UML

reverting index and uml

* Updating timestep interface to match UML and missing parts of UML

* updating model and timestep to reflect new flow

* including UML in doxyfile

* Addressing PR comments

* [Feature] Model Ownership (#143)

* uml and some basic constructors

Updating public diagram

updating UML

reverting index and uml

* thinking through Model updates

* Making repo wide changes to match transition and model syntax so project compiles. Tests commented out, no expectation simulation works yet

* Updating model and unit tests

* [Feature] Intervention Ownership (#144)

* uml and some basic constructors

Updating public diagram

updating UML

reverting index and uml

* thinking through Model updates

* Making repo wide changes to match transition and model syntax so project compiles. Tests commented out, no expectation simulation works yet

* Removing GetLogName() function from transitions and replacing with protected member. Additional background death tests

* cleaning up imports and adding behavior tests

* Adding protected functions to transition base to help with testing dimensions

* overdose tests

* simulation test update

* intervention clone function testing

* Adding integration tests

* RemoveTransition function added

* Addressing PR Comments #143

* Fixing logging test dependency

* Ahhhhh

* Addressing PR comments

* fixing respond tests to have the correct final state

* [Feature] History and UML Update (#146)

* thinking through Model updates

* Making repo wide changes to match transition and model syntax so project compiles. Tests commented out, no expectation simulation works yet

* Removing GetLogName() function from transitions and replacing with protected member. Additional background death tests

* cleaning up imports and adding behavior tests
